Revit 2021.1 API
Alignment.GetClosestStation Method
 Calculates the alignment station closest to the given model point.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021.1
Syntax
C#
public double GetClosestStation(
	XYZ point
)
Visual Basic
Public Function GetClosestStation ( _
	point As XYZ _
) As Double
Visual C++
public:
double GetClosestStation(
	XYZ^ point
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
The model point for which to calculate the closest station.
Return Value
The alignment station closest to the given model point.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace